IDEA Open Model
BeamLoadsImportMappingData.BeamID Property
Compatible with IDEA StatiCa v 10.1
 BeamID
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public int BeamID { get; set; }
Public Property BeamID As Integer
	Get
	Set
public:
property int BeamID {
	int get ();
	void set (int value);
}
Property Value
Type: Int32
See Also
Reference
BeamLoadsImportMappingData Class
IdeaRS.OpenModel.Connection Namespace